app/controllers/projects_controller.rb

INSERT INTO "projects" ("title", "description", "image_url", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save

UPDATE "projects" SET "image_url" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["image_url", "portafolio/app/assets/images/SIMPI.png"], ["updated_at", "2022-07-19 05:08:53.446556"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @project.update(project_params)