app/controllers/store_controller.rb

  def index
    @projects = Project.order(:title)
---
SELECT "projects".* FROM "projects" ORDER BY "projects"."title" ASC